package tree;

/**
 * @author hankin
 * @date 2020/7/24 19:06
 */
public class HafumanTree {
    /**
     *
     * 构建哈夫曼树：
     *  构建思路：贪心算法：利用局部最优推出全局最优
     *
     *  具体实现思路：
     *      1、每次取值最小的两个节点组成一棵树
     *      2、移除原来的两个点
     *      3、将组成的子树放到原来的序列中
     *      4、重复 1、2、3直到最后一个点
     *
     *  e.g
     *  a:3 b:24 c:6 d:20 e:34 f:4 g:12
     *
     *  min a:3 f:4
     *         7
     *        / \
     *      a:3 b:4
     *
     *  min c:6
     *          13
     *          /\
     *        c:6 7
     *          / \
     *        a:3 b:4
     *
     *  min g:12
     *         25
     *         /\
     *     g:12 13
     *          /\
     *        c:6 7
     *          / \
     *        a:3 b:4
     *
     *  min d:20 b:24
     *
     *         25            44
     *         /\            /\
     *     g:12 13       d:20 b:24
     *          /\
     *        c:6 7
     *          / \
     *        a:3 b:4
     *
     *  min e:34
     *
     *          103
     *         /  \
     *       44    59
     *     /  \   / \
     * a:20 b:24 25 e:34
     *          / \
     *       g:12 13
     *           / \
     *        c:6   7
     *             / \
     *           a:3 f:4
     *  a:10110
     *  b:01
     *  c:1010
     *  d:00
     *  e:11
     *  f:10111
     *
     *
     */
}
